sgrzegorz/STM32F4-mp3-player/Src/main.c
// 4 DIODYled callback na jednym owlacza na drugimm wylacza na rozpoczeciu kodowania i zakonczeniu kodowania

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/

#define READ_BUFFER_SIZE 2 * MAINBUF_SIZE //4096
#define DECODED_MP3_FRAME_SIZE MAX_NGRAN *MAX_NCHAN *MAX_NSAMP
//#define OUT_BUFFER_SIZE			2 * DECODED_MP3_FRAME_SIZE//
#define OUT_BUFFER_SIZE 2 * DECODED_MP3_FRAME_SIZE

#define END_OF_FILE -1
#define READ_ERROR -2
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"
#include "mp3dec.h"
#include "stm32f4_discovery.h" //diody do debugowania
/* USER CODE BEGIN Includes */

#include "stm32f4_discovery_audio.h"
#include "ansi.h"
#include "term_io.h"
#include "dbgu.h"

#define BLUE LED6
#define RED LED5
#define ORANGE LED3
#define GREEN LED4
#define ON BSP_LED_On
#define OFF BSP_LED_Off

enum
{
  PLAY_STATE = 0,
  PAUSE_STATE,
  STOP_STATE,
};

int NEW_KEY = 0;

enum
{
  BUFFER_OFFSET_NONE = 0,
  BUFFER_OFFSET_HALF,
  BUFFER_OFFSET_FULL,
};

enum
{
  SONG_IS_PLAYED_NOW = 0,
  SONG_ISNT_PLAYED_NOW,
};

static uint8_t current_state = PLAY_STATE;
static uint8_t playing = SONG_IS_PLAYED_NOW;

static HMP3Decoder hMP3Decoder;
static uint8_t *read_pointer;
static uint8_t read_buffer[READ_BUFFER_SIZE];
static int offset;
static int result;
static uint8_t buf_offs = BUFFER_OFFSET_NONE;
short out_buffer[OUT_BUFFER_SIZE];
// static int underflows = 0;
static int bytes_left = 0;


char** paths;
int mp3FilesCounter = 0;
int currentFilePosition = -1;
// static int bytes_left_before_decoding = 0;
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s3;

RNG_HandleTypeDef hrng;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart2;

osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2S3_Init(void);
static void MX_SPI1_Init(void);
static void MX_RNG_Init(void);
static void MX_TIM6_Init(void);
static void MX_USART2_UART_Init(void);
void handle_key_press_extraputty(void);
int refill_inbuffer(FIL *in_file);
int mp3_proccess(FIL *mp3_file);
void StartDefaultTask(void const *argument);
void play_mp3(char *songname);
void search_for_songs(char *path);
/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_I2S3_Init();
  MX_SPI1_Init();
  MX_RNG_Init();
  MX_TIM6_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  debug_init(&huart2);
  xprintf("F4 player test!\n");
  xprintf("printf test!\n");
  /* USER CODE END 2 */

